Code-Newborn/Daplink/source/hic_hal/stm32/stm32f103xb/IO_Config.h
/**
 * @file    IO_Config.h
 * @brief
 *
 * DAPLink Interface Firmware
 * Copyright (c) 2009-2016, ARM Limited, All Rights Reserved
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License"); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */

#ifndef __IO_CONFIG_H__
#define __IO_CONFIG_H__

#include "stm32f1xx.h"
#include "compiler.h"
#include "daplink.h"

COMPILER_ASSERT( DAPLINK_HIC_ID == DAPLINK_HIC_ID_STM32F103XB );

// USB control pin
#define USB_CONNECT_PORT_ENABLE()  __HAL_RCC_GPIOA_CLK_ENABLE()
#define USB_CONNECT_PORT_DISABLE() __HAL_RCC_GPIOA_CLK_DISABLE()
#define USB_CONNECT_PORT           GPIOA
#define USB_CONNECT_PIN            GPIO_PIN_15
#define USB_CONNECT_ON()           ( USB_CONNECT_PORT->BSRR = USB_CONNECT_PIN )
#define USB_CONNECT_OFF()          ( USB_CONNECT_PORT->BRR = USB_CONNECT_PIN )

// Connected LED
#define CONNECTED_LED_PORT    GPIOB
#define CONNECTED_LED_PIN     GPIO_PIN_6
#define CONNECTED_LED_PIN_Bit 6

// When bootloader, disable the target port(not used)
#define POWER_EN_PIN_PORT GPIOB
#define POWER_EN_PIN      GPIO_PIN_15
#define POWER_EN_Bit      15

// TODO nRESET OUT Pin 与待调试开发板的NRST连接，用于拖拽烧录
#define nRESET_PIN_PORT GPIOB
#define nRESET_PIN      GPIO_PIN_0
#define nRESET_PIN_Bit  0

// TODO SWD 调试接口SWD引脚
#define SWCLK_TCK_PIN_PORT GPIOA
#define SWCLK_TCK_PIN      GPIO_PIN_14
#define SWCLK_TCK_PIN_Bit  14

#define SWDIO_OUT_PIN_PORT GPIOA
#define SWDIO_OUT_PIN      GPIO_PIN_13
#define SWDIO_OUT_PIN_Bit  13

// 省略未用上
#define SWDIO_IN_PIN_PORT GPIOB
#define SWDIO_IN_PIN      GPIO_PIN_12
#define SWDIO_IN_PIN_Bit  12

// TODO LEDs 用户控制LED
// USB status LED
#define RUNNING_LED_PORT GPIOA
#define RUNNING_LED_PIN  GPIO_PIN_9
#define RUNNING_LED_Bit  9

#define PIN_HID_LED_PORT GPIOA
#define PIN_HID_LED      GPIO_PIN_9
#define PIN_HID_LED_Bit  9

#define PIN_CDC_LED_PORT GPIOA
#define PIN_CDC_LED      GPIO_PIN_9
#define PIN_CDC_LED_Bit  9

#define PIN_MSC_LED_PORT GPIOA
#define PIN_MSC_LED      GPIO_PIN_9
#define PIN_MSC_LED_Bit  9


#endif
